courses = ["Python-разработчик с нуля", "Java-разработчик с нуля", "Fullstack-разработчик на Python", "Frontend-разработчик с нуля"]

mentors = [
	["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
	["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
	["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]

def set_popular_names(a_list):
# добавьте сюда ваш код из Задачи 1
    all_list = []
    for m in a_list:
        all_list.extend(m)
    all_names_list = []
    for mentor in all_list:
      name = mentor.split()
      all_names_list.append(name)
    only_names = []
    for n in all_names_list:
      only_names.append(n[0])

    # подсчитайте встречаемость каждого имени через list.count()
    popular = []
    for name in only_names:
        popular.append([name, only_names.count(name)]) # добавьте  подсчет имен
    #popular_sort = []
    #popular_sort = sorted(popular,key=lambda x: x[1], reverse=True) # возможный вариант сортировки
    popular.sort(key=lambda x:x[1], reverse=True)
    # это код для сортировки списка с элементами вида [имя, количество] по убыванию встречаемости

    # получите топ-три самых часто встречающихся имени из списка popular

    top_count = 0
    unique_names_sort = []
    for i in popular:
      if i not in unique_names_sort:
        unique_names_sort.append(i)
    top_3 = unique_names_sort[:3]
    res_string = ""
    for name, count in top_3:
      if top_count < 2:
        # print(f'{name}: {count} раз(а), ', end='')
        res_string += f'{name}: {count} раз(а), '
        # print(res_string)
      else:
        # print(f'{name}: {count} раз(а)', end='')
        res_string += f'{name}: {count} раз(а), '
        # print(res_string)
      top_count += 1
    return res_string

if __name__=='__main__':
    print(set_popular_names(mentors))